Revit 2027 API
PanelScheduleData Class
 The PanelScheduleData class holds most of the data that describe the layout, appearance, and style of the rows, columns, and cells of a panel schedule
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TableData
 Autodesk.Revit.DB.Electrical.PanelScheduleData
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PanelScheduleData : TableData
Public Class PanelScheduleData
	Inherits TableData
public ref class PanelScheduleData : public TableData
type PanelScheduleData =
    class
        inherit TableData
    end
The PanelScheduleData type exposes the following members.
Properties
Name | Description
BodyShowsVerticalHeaders |  Shows text in the Load Summary section's headers vertically instead of horizontally
BorderAroundSchedule |  Places a border (GraphicStyle element) around the entire schedule, visible only on the instance and sheet
BorderAroundSections |  Places a border (GraphicStyle element) around each section, visible only on the instance and sheet
FreezeColumnsAndRows |  set to true if the columns and rows should be unmovable by the slider grips
(Inherited from TableData)
IsAutoShadingForLoadDisplay |  Display shading of load cells automatically or not.
IsFooterSectionHidden |  True if the user wishes to hide the footer section; setting this value must go through the appropriate update function
IsHeaderSectionHidden |  True if the user wishes to hide the header section; setting this value must go through the appropriate update function
IsPanelSinglePhase |  Identifies if the panel is single phase.
IsSummarySectionHidden |  True if the user wishes to hide the summary section; setting this value must go through the appropriate update function
IsUnusedPhaseHidden |  True if the user wishes to hide the unused phase column of a single phase panel, false otherwise.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from TableData)
NumberOfSections |  Gets the number of items in section data array.
(Inherited from TableData)
NumberOfSlots |  The number of slots in the panel schedule; setting this value must go through the appropriate update function
PanelConfiguration |  The panel configuration of this panel schedule
PhaseLoadType |  This property determines the layout of the phase load columns; setting this value must go through the updateCircuitTable function
PhasesAsCurrents |  If true, the phase columns are currents (A), otherwise they are loads (VA); setting this value must go through the appropriate update function
ScheduleType |  The panel schedule type of this panel schedule
ShowCircuitNumberOnOneRowForMultiphaseCircuits |  Shows the circuit number broken up on each row of the multiphase circuit rows if true, all on the first row otherwise
ShowMultipleRowsForMultiphaseCircuits |  shows extra rows below multiphase circuits to indicate how many slots they take up if true, all on a single row otherwise
ShowSlotFromDeviceInsteadOfTemplate |  When true, the number of rows in an instance will be the number of poles on the associated device, not a set number
SummaryShowsGroups |  Show groups of load classifications in the load summary section
SummaryShowsOnlyConnectedLoads |  Show only the connected load classifications in the summary section
SummaryShowsVerticalHeaders |  Shows text in the Load Summary section's headers vertically instead of horizontally
Width |  Gets or sets the table width in feet
(Inherited from TableData)
WidthInPixels |  Gets the width of the panel schedule in logical pixels
(Inherited from TableData)
ZoomLevel |  The value of zoom level for corresponding TableView.
(Inherited from TableData)
Top
Methods
Name | Description
AddLoadClassification |  Add a Load Classification Id to the array of Load Classifications.
Dispose
(Inherited from TableData)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLoadClassifications |  Gets an array of the load classifications associated with this panel schedule
GetNumberOfCircuitRows |  Gets the number of rows in the circuit table
GetSectionData(Int32) |  Returns the section data array element at the specified index.
(Inherited from TableData)
GetSectionData(SectionType) |  Returns the pointer to the section data array element at the specified section type.
(Inherited from TableData)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsEqual |  Checks if this element is equal in value to the other element.
(Inherited from TableData)
IsSymmetric |  Check if this panel schedule is symmetric
IsValidZoomLevel |  Verifies if the value of zoom level is valid.
(Inherited from TableData)
RemoveLoadClassification |  Remove a Load Classification Id from the array of Load Classifications
SetBorderAroundSchedule |  Adds a border around the schedule
SetBorderAroundSections |  Adds a border around the sections
SetLoadClassifications |  Sets the Load Classifications associated with this panel schedule
ToString | Returns a string that represents the current object.
(Inherited from Object)
UpdateCircuitTableForInstance |  Redraw the circuit table for the given panel with the given parameter updates
UpdateCircuitTableForTemplate |  Redraw the circuit table for a template with the given parameter updates
UpdateIsSectionHidden |  Update if this section is hidden or not
UpdateLoadSummary |  Update the load summary section
UpdateVerticalHeadersInSection |  Sets if this header should have vertical text
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace